app/controllers/api/v0/mobile_api_controller.rb

		def register
			response = Hash.new
			result = Hash.new
			if params[:device_id]
				device = DeviceRegistration.find_or_initialize_by(device_id: params[:device_id].to_s.strip)
				device.email = params[:email].to_s.strip
				device.registration_key = params[:registration_key].to_s.strip
				device.user_id = params[:user_id] if params[:user_id]
				device.platform = params[:platform] || 'Android'
				if device.save!
---
SELECT  "device_registrations".* FROM "device_registrations" WHERE "device_registrations"."device_id" = $1 LIMIT 1  [["device_id", "55e87d70bf1a076a"]]
UPDATE "device_registrations" SET "registration_key" = $1, "user_id" = $2, "updated_at" = $3 WHERE "device_registrations"."id" = $4

		def login
			response = Hash.new
			result = Hash.new
			if !params[:user].nil?
				user_data = JSON.parse(params[:user])
				user_data['email'] = user_data['email'] || "#{user_data['uid']}@#{user_data['provider']}.com"
				if user_data && !user_data['email'].empty?
					user = User.find_or_initialize_by(email: user_data['email'])
					if user.new_record?
						user.first_name = user_data['first_name']
						user.last_name = user_data['last_name']
						user.about_me = user_data['about_me']
						user.city = user_data['city']
						user.profile_img = user_data['profile_img'] || "https://graph.facebook.com/#{user_data['uid']}/picture?type=small"
						user.cover_img = user_data['cover_img']
						user.profile_type = "Foodie"
						user.email = user_data['email']
						user.current_sign_in_at = Time.zone.now
						user.current_sign_in_ip = request.ip
						user.save!
					end
					auth = Authentication.find_or_initialize_by(provider: user_data['provider'], uid: user_data['uid'])
					auth.token = user_data['token']
					auth.token_expiry_at = user_data['token_expiry_at']
					auth.user_id = user.id
					auth.save!
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "arshad_glamour@yahoo.co.in"]]
UPDATE "users" SET "sign_in_count" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["sign_in_count", 1], ["updated_at", "2015-09-26 20:48:40.484015"], ["id", 1]]
SELECT  "authentications".* FROM "authentications" WHERE "authentications"."provider" = $1 AND "authentications"."uid" = $2 LIMIT 1  [["provider", "facebook"], ["uid", "1046596925373692"]]
UPDATE "authentications" SET "token" = $1, "updated_at" = $2 WHERE "authentications"."id" = $3

		def create_post
			response = Hash.new
			result = Hash.new
			post = Post.find_or_initialize_by(user_id: params[:user_id], location:params[:location], date: Date.today)
			post.description = params[:description]
			post.location_lat = params[:loc_lat]
			post.location_lng = params[:loc_lng]
			post.user_lat = params[:user_lat]
			post.user_lng = params[:user_lng]
			post.category_id = params[:category_id]
			post.max_people = params[:max_people]
			post.min_people = params[:min_people]
			if post.save!
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."location" = $2 AND "posts"."date" = $3 LIMIT 1  [["user_id", 3], ["location", "CSC Parking"], ["date", "2015-09-27"]]
UPDATE "posts" SET "description" = $1, "category_id" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["description", "hhvh"], ["category_id", 2], ["updated_at", "2015-09-27 01:12:54.171755"], ["id", 1]]

		def all_post
			response = Hash.new
			result = Hash.new
			if !params[:user_id].empty?
				posts = Post.includes(:user).where.not(user_id: params[:user_id].to_i)
							.where('created_at > ?', (Time.now - 5.hour))
---
SELECT "posts".* FROM "posts" WHERE ("posts"."user_id" != $1) AND (created_at > '2015-09-27 00:31:56.532659')  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (3)